---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralConnectionHandler.SingleElementEndIndex
source: html/2d7a6f59-79d8-d628-160b-e78365966c9f.htm
---
# Autodesk.Revit.DB.Structure.StructuralConnectionHandler.SingleElementEndIndex Property

Element end index for single element connections (0: start, 1: end).

## Syntax (C#)
```csharp
public int SingleElementEndIndex { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: singleElementEndIndex is not a valid end index.